openfoam/day1/chamber-offset-fine/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4000;

deltaT          1;

writeControl    timeStep;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

functions
{
    inletFlow
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        regionType      patch;
        name            inlet;
        operation       sum;
        fields          ( phi );
        writeFields     false;
        log             true;
        writePrecision  12;
        writeControl    timeStep;
        writeInterval   10;
    }
    leftOutletFlow
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        regionType      patch;
        name            outletLeft;
        operation       sum;
        fields          ( phi );
        writeFields     false;
        log             true;
        writePrecision  12;
        writeControl    timeStep;
        writeInterval   10;
    }
    rightOutletFlow
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        regionType      patch;
        name            outletRight;
        operation       sum;
        fields          ( phi );
        writeFields     false;
        log             true;
        writePrecision  12;
        writeControl    timeStep;
        writeInterval   10;
    }
    leftOutletMagnitude
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        regionType      patch;
        name            outletLeft;
        operation       sumMag;
        fields          ( phi );
        writeFields     false;
        log             true;
        writePrecision  12;
        writeControl    timeStep;
        writeInterval   10;
    }
    rightOutletMagnitude
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        regionType      patch;
        name            outletRight;
        operation       sumMag;
        fields          ( phi );
        writeFields     false;
        log             true;
        writePrecision  12;
        writeControl    timeStep;
        writeInterval   10;
    }
}


// ************************************************************************* //
